Revit 2018 API
ProjectLocation.IsProjectLocationNameUnique Method
 Verifies that there is no existing ProjectLocation with the given name in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2018
Syntax
C#
public static bool IsProjectLocationNameUnique(
	Document document,
	string name
)
Visual Basic
Public Shared Function IsProjectLocationNameUnique ( _
	document As Document, _
	name As String _
) As Boolean
Visual C++
public:
static bool IsProjectLocationNameUnique(
	Document^ document,
	String^ name
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document to check.
name
Type: System.String
 The name to check.
Return Value
 True if the name is unused (among ProjectLocations). False otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
ProjectLocation Class
Autodesk.Revit.DB Namespace